tylertms/dspic33e-sim/conformance/dci.c
#include <inttypes.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>

#include "device.h"
#include "dspic33.h"

typedef struct {
    uint32_t cases;
    uint32_t passed;
    uint32_t failed;
} DciConformance;

enum {
    DCI_CONTROL1 = 0x0280u,
    DCI_CONTROL2 = 0x0282u,
    DCI_CONTROL3 = 0x0284u,
    DCI_STATUS = 0x0286u,
    DCI_TRANSMIT_SLOTS = 0x0288u,
    DCI_RECEIVE_SLOTS = 0x028cu,
    DCI_RECEIVE_BASE = 0x0290u,
    DCI_TRANSMIT_BASE = 0x0298u,
    DCI_ENABLE = 0x8000u,
    DCI_STOP_IDLE = 0x2000u,
    DCI_LOOPBACK = 0x0800u,
    DCI_EXTERNAL_CLOCK = 0x0400u,
    DCI_EXTERNAL_FRAME = 0x0100u,
    DCI_UNDERFLOW_LAST = 0x0080u,
    DCI_TRISTATE = 0x0040u,
    DCI_DATA_JUSTIFY = 0x0020u,
    DCI_SAMPLE_RISING = 0x0200u,
    DCI_MODE_I2S = 0x0001u,
    DCI_MODE_AC_LINK_16 = 0x0002u,
    DCI_MODE_AC_LINK_20 = 0x0003u,
    DCI_RECEIVE_OVERFLOW = 0x0008u,
    DCI_RECEIVE_FULL = 0x0004u,
    DCI_TRANSMIT_UNDERFLOW = 0x0002u,
    DCI_TRANSMIT_EMPTY = 0x0001u,
    DCI_PMD = 0x0760u,
    DCI_PMD_MASK = 0x0100u,
    DCI_ERROR_IRQ = 59u,
    DCI_TRANSFER_IRQ = 60u,
    DCI_DMA_REQUEST = 0x3cu,
    DCI_VECTOR = 0x0200u,
    OPCODE_SLEEP = 0xfe4000u,
    OPCODE_IDLE = 0xfe4001u
};

static void expect(DciConformance* state, bool condition, const char* name) {
    state->cases++;
    if (condition) {
        state->passed++;
    } else {
        state->failed++;
        printf("[dci-failed] %s\n", name);
    }
}

static uint16_t configuration(uint8_t width, uint8_t slots, uint8_t buffers) {
    return (uint16_t)(((uint16_t)(buffers - 1u) << 10u) |
                      ((uint16_t)(slots - 1u) << 5u) | (width - 1u));
}

static bool clock_word(Dspic33* cpu, uint16_t value, bool frame_sync) {
    return dspic33_dci_clock(cpu, value, frame_sync, 0u) &&
           dspic33_device_advance(cpu, 0u);
}

static void configure_external(Dspic33* cpu, uint16_t control, uint8_t width,
                               uint8_t slots, uint8_t buffers, uint16_t transmit,
                               uint16_t receive) {
    dspic33_write_word(cpu, DCI_CONTROL1, 0u);
    dspic33_write_word(cpu, DCI_CONTROL2, configuration(width, slots, buffers));
    dspic33_write_word(cpu, DCI_CONTROL3, 0u);
    dspic33_write_word(cpu, DCI_TRANSMIT_SLOTS, transmit);
    dspic33_write_word(cpu, DCI_RECEIVE_SLOTS, receive);
    dspic33_write_word(cpu, DCI_CONTROL1,
                       (uint16_t)(DCI_ENABLE | DCI_EXTERNAL_CLOCK | control));
}

static uint16_t interrupt_word(uint8_t irq, uint16_t base) {
    return (uint16_t)(base + (irq / 16u) * 2u);
}

static uint16_t interrupt_mask(uint8_t irq) { return (uint16_t)(1u << (irq % 16u)); }

static bool interrupt_set(Dspic33* cpu, uint8_t irq) {
    return (dspic33_read_word(cpu, interrupt_word(irq, 0x0800u)) &
            interrupt_mask(irq)) != 0u;
}

static void clear_interrupt(Dspic33* cpu, uint8_t irq) {
    uint16_t address = interrupt_word(irq, 0x0800u);
    dspic33_write_word(
        cpu, address,
        (uint16_t)(dspic33_read_word(cpu, address) & ~interrupt_mask(irq)));
}

static void enable_interrupt(Dspic33* cpu, uint8_t irq, uint8_t priority) {
    uint16_t enable = interrupt_word(irq, 0x0820u);
    uint16_t ipc = (uint16_t)(0x0840u + (irq / 4u) * 2u);
    uint16_t shift = (uint16_t)((irq % 4u) * 4u);
    dspic33_write_word(
        cpu, enable, (uint16_t)(dspic33_read_word(cpu, enable) | interrupt_mask(irq)));
    dspic33_write_word(
        cpu, ipc,
        (uint16_t)((dspic33_read_word(cpu, ipc) & ~(uint16_t)(7u << shift)) |
                   (uint16_t)(priority << shift)));
    cpu->program[(0x0014u + irq * 2u) / 2u] = DCI_VECTOR;
}

static void configure_dma(Dspic33* cpu, uint8_t channel, uint16_t control,
                          uint32_t memory, uint16_t pad, uint16_t count,
                          uint8_t request) {
    uint16_t base = (uint16_t)(0x0b00u + channel * 0x10u);
    dspic33_write_word(cpu, base, 0u);
    dspic33_write_word(cpu, (uint16_t)(base + 2u), request);
    dspic33_write_word(cpu, (uint16_t)(base + 4u), (uint16_t)memory);
    dspic33_write_word(cpu, (uint16_t)(base + 6u), (uint16_t)(memory >> 16u));
    dspic33_write_word(cpu, (uint16_t)(base + 8u), 0u);
    dspic33_write_word(cpu, (uint16_t)(base + 0x0au), 0u);
    dspic33_write_word(cpu, (uint16_t)(base + 0x0cu), pad);
    dspic33_write_word(cpu, (uint16_t)(base + 0x0eu), count);
    dspic33_write_word(cpu, base, (uint16_t)(control | 0x8000u));
}

static void access_cases(DciConformance* state, Dspic33* cpu) {
    uint8_t index;
    dspic33_reset(cpu, 0u);
    for (index = 0u; index < 4u; index++) {
        expect(state,
               dspic33_read_word(cpu, (uint16_t)(DCI_RECEIVE_BASE + index * 2u)) == 0u,
               "RXBUF deterministic POR value");
        expect(state,
               dspic33_read_word(cpu, (uint16_t)(DCI_TRANSMIT_BASE + index * 2u)) == 0u,
               "TXBUF reads zero at POR");
    }
    expect(state, dspic33_read_word(cpu, DCI_CONTROL1) == 0u, "DCICON1 reset");
    expect(state, dspic33_read_word(cpu, DCI_CONTROL2) == 0u, "DCICON2 reset");
    expect(state, dspic33_read_word(cpu, DCI_CONTROL3) == 0u, "DCICON3 reset");
    expect(state, dspic33_read_word(cpu, DCI_STATUS) == 0u, "DCISTAT reset");
    expect(state, dspic33_read_word(cpu, DCI_TRANSMIT_SLOTS) == 0u, "TSCON reset");
    expect(state, dspic33_read_word(cpu, DCI_RECEIVE_SLOTS) == 0u, "RSCON reset");

    dspic33_write_word(cpu, DCI_CONTROL1, UINT16_MAX);
    dspic33_write_word(cpu, DCI_CONTROL2, UINT16_MAX);
    dspic33_write_word(cpu, DCI_CONTROL3, UINT16_MAX);
    dspic33_write_word(cpu, DCI_STATUS, UINT16_MAX);
    dspic33_write_word(cpu, DCI_TRANSMIT_SLOTS, UINT16_MAX);
    dspic33_write_word(cpu, DCI_RECEIVE_SLOTS, UINT16_MAX);
    expect(state, dspic33_read_word(cpu, DCI_CONTROL1) == 0xafe3u,
           "DCICON1 access mask");
    expect(state, dspic33_read_word(cpu, DCI_CONTROL2) == 0x0defu,
           "DCICON2 access mask");
    expect(state, dspic33_read_word(cpu, DCI_CONTROL3) == 0x0fffu,
           "DCICON3 access mask");
    expect(state, dspic33_read_word(cpu, DCI_STATUS) == 0u, "DCISTAT is read only");
    expect(state, dspic33_read_word(cpu, DCI_TRANSMIT_SLOTS) == UINT16_MAX,
           "TSCON access mask");
    expect(state, dspic33_read_word(cpu, DCI_RECEIVE_SLOTS) == UINT16_MAX,
           "RSCON access mask");
    for (index = 0u; index < 4u; index++) {
        uint16_t rx = (uint16_t)(DCI_RECEIVE_BASE + index * 2u);
        uint16_t tx = (uint16_t)(DCI_TRANSMIT_BASE + index * 2u);
        dspic33_write_word(cpu, rx, 0x55aau);
        dspic33_write_word(cpu, tx, (uint16_t)(0x1000u + index));
        expect(state, dspic33_read_word(cpu, rx) == 0u, "RXBUF rejects CPU write");
        expect(state, dspic33_read_word(cpu, tx) == 0u, "TXBUF is write only");
    }
}

