tylertms/dspic33e-sim/conformance/dci.c
    dspic33_write_word(cpu, DCI_CONTROL3, 0u);
    dspic33_dci_input(cpu, 0x5000u);
    expect(state,
           dspic33_device_advance(cpu, 32u) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0xa000u,
           "BCG zero freezes a running internal DCI clock");
    dspic33_write_word(cpu, DCI_CONTROL3, 1u);
    expect(state,
           dspic33_device_advance(cpu, 16u) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0x5000u,
           "restored BCG resumes internal DCI clock");

    dspic33_dci_input(cpu, 0x6000u);
    cpu->power_state = DSPIC33_POWER_SLEEP;
    expect(state,
           dspic33_device_advance(cpu, 32u) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0x5000u,
           "Sleep stops internal DCI clock");
    cpu->power_state = DSPIC33_POWER_ACTIVE;
    expect(state,
           dspic33_device_advance(cpu, 16u) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0x6000u,
           "internal DCI clock resumes after Sleep");
}

static void protocol_geometry_cases(DciConformance* state, Dspic33* cpu) {
    uint8_t mode;
    for (mode = 0u; mode < 4u; mode++) {
        uint8_t width;
        for (width = 4u; width <= 16u; width++) {
            uint8_t frames;
            for (frames = 1u; frames <= 16u; frames++) {
                uint8_t options;
                for (options = 0u; options < 4u; options++) {
                    Dspic33DciTransfer transfer;
                    uint16_t control = mode;
                    uint16_t expected_mask = UINT16_MAX;
                    uint8_t expected_frames = frames;
                    uint16_t transmit = (uint16_t)(0xa55au + frames + width);
                    uint16_t receive = (uint16_t)(0x5aa5u + frames + width);
                    if ((options & 1u) != 0u) {
                        control |= DCI_DATA_JUSTIFY;
                    }
                    if ((options & 2u) != 0u) {
                        control |= DCI_SAMPLE_RISING;
                    }
                    if (mode < DCI_MODE_AC_LINK_16 && width < 16u) {
                        expected_mask = (uint16_t)(UINT16_MAX << (16u - width));
                    }
                    if (mode == DCI_MODE_AC_LINK_16) {
                        expected_frames = 13u;
                    } else if (mode == DCI_MODE_AC_LINK_20) {
                        expected_frames = 16u;
                    }
                    dspic33_reset(cpu, 0u);
                    configure_external(cpu, control, width, frames, 1u, 1u, 1u);
                    dspic33_write_word(cpu, DCI_TRANSMIT_BASE, transmit);
                    expect(state, clock_word(cpu, receive, false),
                           "clock protocol geometry word");
                    expect(state,
                           dspic33_dci_transmit(cpu, &transfer) &&
                               transfer.slot == 0u &&
                               transfer.value == (transmit & expected_mask) &&
                               transfer.driven,
                           "protocol selects effective transmit geometry");
                    expect(state,
                           dspic33_read_word(cpu, DCI_RECEIVE_BASE) ==
                               (receive & expected_mask),
                           "protocol selects effective receive geometry");
                    expect(state, cpu->io.dci.slot == (expected_frames == 1u ? 0u : 1u),
                           "protocol selects effective frame geometry");
                }
            }
        }
    }
}

static void protocol_frame_cases(DciConformance* state, Dspic33* cpu) {
    uint8_t justification;
    for (justification = 0u; justification < 2u; justification++) {
        uint16_t control = (uint16_t)(DCI_MODE_I2S | DCI_EXTERNAL_FRAME |
                                      (justification != 0u ? DCI_DATA_JUSTIFY : 0u));
        dspic33_reset(cpu, 0u);
        configure_external(cpu, control, 8u, 2u, 2u, 0u, 3u);
        expect(state, clock_word(cpu, 0x1100u, false),
               "I2S slave waits for frame edge");
        expect(state, cpu->io.dci.receive_buffered == 0u && !cpu->io.dci.started,
               "I2S absent frame edge leaves transfer idle");
        expect(state, clock_word(cpu, 0x2200u, true),
               "I2S frame edge starts half-frame");
        expect(state, cpu->io.dci.receive_buffered == 1u && cpu->io.dci.slot == 1u,
               "I2S frame edge transfers first logical word");
        expect(state, clock_word(cpu, 0x3300u, false),
               "I2S half-frame transfers remaining logical word");
        expect(state,
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0x2200u &&
                   dspic33_read_word(cpu, DCI_RECEIVE_BASE + 2u) == 0x3300u &&
                   !cpu->io.dci.started,
               "I2S half-frame completes at programmed boundary");
        expect(state, clock_word(cpu, 0x4400u, false),
               "I2S waits for next frame edge after boundary");
        expect(state, cpu->io.dci.receive_buffered == 0u,
               "I2S idle edge gap transfers no word");
    }
}

static void ac_link_cases(DciConformance* state, Dspic33* cpu) {
    Dspic33DciTransfer transfer;
    uint8_t slot;
    dspic33_reset(cpu, 0u);
    configure_external(cpu, DCI_MODE_AC_LINK_16, 4u, 1u, 2u, 0x3001u, 0x3001u);
    dspic33_write_word(cpu, DCI_TRANSMIT_BASE, 0x1111u);
    dspic33_write_word(cpu, DCI_TRANSMIT_BASE + 2u, 0xccccu);
    for (slot = 0u; slot < 13u; slot++) {
        expect(state, clock_word(cpu, (uint16_t)(0x2000u + slot), false),
               "clock 16-bit AC-Link slot");
        expect(state,
               dspic33_dci_transmit(cpu, &transfer) && transfer.slot == slot &&
                   transfer.driven,
               "16-bit AC-Link reports fixed slot position");
    }
    expect(state,
           dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0x2000u &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE + 2u) == 0x200cu,
           "16-bit AC-Link buffers tag and slot twelve");
    expect(state, cpu->io.dci.slot == 0u, "16-bit AC-Link wraps after thirteen slots");
    expect(state, (cpu->io.dci.receive_buffered | cpu->io.dci.transmit_buffered) == 0u,
           "16-bit AC-Link ignores slot thirteen enables");

    dspic33_reset(cpu, 0u);
    configure_external(cpu, DCI_MODE_AC_LINK_20, 4u, 1u, 2u, 0x8001u, 0x8001u);
    dspic33_write_word(cpu, DCI_TRANSMIT_BASE, 0x1234u);
    dspic33_write_word(cpu, DCI_TRANSMIT_BASE + 2u, 0xabcdu);
    for (slot = 0u; slot < 16u; slot++) {
        expect(state, clock_word(cpu, (uint16_t)(0x4000u + slot), false),
               "clock 20-bit AC-Link packed slot");
        expect(state, dspic33_dci_transmit(cpu, &transfer) && transfer.slot == slot,
               "20-bit AC-Link reports packed slot position");
    }
    expect(state,
           dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0x4000u &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE + 2u) == 0x400fu,
           "20-bit AC-Link buffers first and final packed slots");
    expect(state, cpu->io.dci.slot == 0u,
           "20-bit AC-Link wraps after sixteen packed slots");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, DCI_CONTROL2, configuration(4u, 1u, 2u));
    dspic33_write_word(cpu, DCI_CONTROL3, 1u);
    dspic33_write_word(cpu, DCI_TRANSMIT_SLOTS, 3u);
    dspic33_write_word(cpu, DCI_RECEIVE_SLOTS, 3u);
    dspic33_write_word(cpu, DCI_TRANSMIT_BASE, 0x1111u);
    dspic33_write_word(cpu, DCI_TRANSMIT_BASE + 2u, 0x2222u);
    dspic33_write_word(cpu, DCI_CONTROL1, DCI_ENABLE | DCI_MODE_AC_LINK_16);
    expect(state, dspic33_device_advance(cpu, 75u) && cpu->io.dci.output.count == 0u,
           "16-bit AC-Link waits through tag-slot boundary");
    expect(state,
           dspic33_device_advance(cpu, 1u) && dspic33_dci_transmit(cpu, &transfer) &&
               transfer.slot == 0u,
           "16-bit AC-Link completes sixteen-clock tag slot");
    expect(state, dspic33_device_advance(cpu, 79u) && cpu->io.dci.output.count == 0u,
           "16-bit AC-Link waits through data-slot boundary");
    expect(state,
           dspic33_device_advance(cpu, 1u) && dspic33_dci_transmit(cpu, &transfer) &&
               transfer.slot == 1u,
           "16-bit AC-Link completes twenty-clock data slot");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, DCI_CONTROL2, configuration(4u, 1u, 2u));
    dspic33_write_word(cpu, DCI_CONTROL3, 1u);
    dspic33_write_word(cpu, DCI_TRANSMIT_SLOTS, 3u);
    dspic33_write_word(cpu, DCI_CONTROL1, DCI_ENABLE | DCI_MODE_AC_LINK_20);
    expect(state, dspic33_device_advance(cpu, 75u) && cpu->io.dci.output.count == 0u,
           "20-bit AC-Link waits through first packed-slot boundary");
    expect(state,
           dspic33_device_advance(cpu, 1u) && dspic33_dci_transmit(cpu, &transfer) &&
               transfer.slot == 0u,
           "20-bit AC-Link completes first sixteen-clock packed slot");
    expect(state, dspic33_device_advance(cpu, 63u) && cpu->io.dci.output.count == 0u,
           "20-bit AC-Link waits through second packed-slot boundary");
    expect(state,
           dspic33_device_advance(cpu, 1u) && dspic33_dci_transmit(cpu, &transfer) &&
               transfer.slot == 1u,
           "20-bit AC-Link keeps sixteen-clock packed-slot timing");
}

static void protocol_integration_cases(DciConformance* state, Dspic33* cpu) {
    uint8_t mode;
    for (mode = 0u; mode < 4u; mode++) {
        uint16_t expected = mode >= DCI_MODE_AC_LINK_16 ? 0x5aa5u : 0x5a00u;
        dspic33_reset(cpu, 0u);
        configure_external(cpu, (uint16_t)(mode | DCI_EXTERNAL_FRAME), 8u, 2u, 1u, 0u,
                           1u);
        expect(state, clock_word(cpu, 0x1100u, false),
               "protocol slave clocks without frame indication");
        expect(state, dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0u,
               "protocol slave remains idle before frame indication");
        expect(state, clock_word(cpu, 0x2200u, true),
               "protocol slave accepts frame indication");
        expect(state, dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0x2200u,
               "protocol slave captures synchronized word");

        dspic33_reset(cpu, 0u);
        configure_dma(cpu, 0u, 0x0001u, (uint32_t)(0x4400u + mode * 2u),
                      DCI_RECEIVE_BASE, 0u, DCI_DMA_REQUEST);
        configure_external(cpu, mode, 8u, 1u, 1u, 0u, 1u);
        expect(state, clock_word(cpu, 0x5aa5u, false),
               "protocol raises receive DMA request");
        expect(state, dspic33_device_advance(cpu, 2u),
               "protocol completes receive DMA transfer");
        expect(state,
               dspic33_read_word(cpu, (uint16_t)(0x4400u + mode * 2u)) == expected,
               "protocol DMA observes effective word geometry");
    }

    for (mode = DCI_MODE_AC_LINK_16; mode <= DCI_MODE_AC_LINK_20; mode++) {
        uint8_t width;
        for (width = 1u; width < 4u; width++) {
            dspic33_reset(cpu, 0u);
            configure_external(cpu, mode, width, 1u, 1u, 0u, 1u);
            expect(state,
                   clock_word(cpu, 0xa55au, false) &&
                       dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0xa55au,
                   "AC-Link ignores programmed word-size field");
        }
    }
}

static void mode_and_status_cases(DciConformance* state, Dspic33* cpu) {
    Dspic33DciTransfer transfer;
    uint8_t mode;
    for (mode = 0u; mode < 2u; mode++) {
        dspic33_reset(cpu, 0u);
        configure_external(cpu, mode != 0u ? DCI_UNDERFLOW_LAST : 0u, 16u, 1u, 1u, 1u,
                           0u);
        dspic33_write_word(cpu, DCI_TRANSMIT_BASE, 0x5a5au);
        expect(state, clock_word(cpu, 0u, false), "clock initial underflow mode word");
        expect(state, dspic33_dci_transmit(cpu, &transfer) && transfer.value == 0x5a5au,
               "initial TXBUF value reaches DCI output");
        expect(state, clock_word(cpu, 0u, false), "clock underflow replacement word");
        expect(state,
               dspic33_dci_transmit(cpu, &transfer) &&
                   transfer.value == (mode != 0u ? 0x5a5au : 0u),
               "UNFM selects last value or zero after underflow");
        expect(state,
               (dspic33_read_word(cpu, DCI_STATUS) & DCI_TRANSMIT_UNDERFLOW) != 0u,
               "missing TXBUF sets TUNF");
        dspic33_write_word(cpu, DCI_TRANSMIT_BASE, 0x6b6bu);
        expect(state,
               (dspic33_read_word(cpu, DCI_STATUS) & DCI_TRANSMIT_UNDERFLOW) == 0u,
               "culprit TXBUF write clears TUNF");
    }

    dspic33_reset(cpu, 0u);
    configure_external(cpu, DCI_LOOPBACK, 16u, 1u, 1u, 1u, 1u);
    dspic33_write_word(cpu, DCI_TRANSMIT_BASE, 0x1357u);
    expect(state, clock_word(cpu, 0x2468u, false), "clock loopback word");
    expect(state, dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0x1357u,
           "DLOOP routes transmit shadow into receive buffer");

    dspic33_reset(cpu, 0u);
    configure_external(cpu, 0u, 16u, 2u, 1u, 1u, 0u);
    dspic33_write_word(cpu, DCI_TRANSMIT_BASE, 0x7777u);
    expect(state, clock_word(cpu, 0u, false), "clock driven active slot");
    expect(state, dspic33_dci_transmit(cpu, &transfer) && transfer.driven,
           "enabled transmit slot drives output");
    expect(state, clock_word(cpu, 0u, false), "clock driven disabled slot");
    expect(state,
           dspic33_dci_transmit(cpu, &transfer) && transfer.value == 0u &&
               transfer.driven,
           "CSDOM zero drives disabled slot low");

    dspic33_reset(cpu, 0u);
    configure_external(cpu, DCI_TRISTATE, 16u, 2u, 1u, 1u, 0u);
    dspic33_write_word(cpu, DCI_TRANSMIT_BASE, 0x8888u);
    expect(state, clock_word(cpu, 0u, false), "clock tristate active slot");
    expect(state, dspic33_dci_transmit(cpu, &transfer) && transfer.driven,
           "CSDOM one still drives enabled transmit slot");
    expect(state, clock_word(cpu, 0u, false), "clock tristate disabled slot");
    expect(state, dspic33_dci_transmit(cpu, &transfer) && !transfer.driven,
           "CSDOM one tri-states disabled slot");

    dspic33_reset(cpu, 0u);
    configure_external(cpu, 0u, 16u, 1u, 2u, 0u, 1u);
    expect(state, clock_word(cpu, 0x1001u, false) && clock_word(cpu, 0x1002u, false),
           "fill two receive buffers");
    expect(state, cpu->io.dci.receive_unread == 0x03u,
           "RFUL tracks both unread RXBUFs");
    expect(state, dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0x1001u,
           "read first RXBUF independently");
    expect(state,
           cpu->io.dci.receive_unread == 0x02u &&
               (dspic33_read_word(cpu, DCI_STATUS) & DCI_RECEIVE_FULL) != 0u,
           "RFUL remains until every active RXBUF is read");
    expect(state, clock_word(cpu, 0x2001u, false) && clock_word(cpu, 0x2002u, false),
           "overwrite partially unread receive block");
    expect(state, cpu->io.dci.receive_overflow == 0x02u,
           "ROV identifies only the unread overwritten RXBUF");
    expect(state, dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0x2001u,
           "nonculprit RXBUF read preserves ROV");
    expect(state, (dspic33_read_word(cpu, DCI_STATUS) & DCI_RECEIVE_OVERFLOW) != 0u,
           "ROV persists until culprit RXBUF read");
    expect(state, dspic33_read_word(cpu, DCI_RECEIVE_BASE + 2u) == 0x2002u,
           "read overflow culprit RXBUF");
    expect(state, (dspic33_read_word(cpu, DCI_STATUS) & DCI_RECEIVE_OVERFLOW) == 0u,
           "culprit RXBUF read clears ROV");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, DCI_CONTROL2, configuration(16u, 2u, 4u));
    dspic33_write_word(cpu, DCI_TRANSMIT_BASE, 0x1111u);
    dspic33_write_word(cpu, DCI_TRANSMIT_BASE + 4u, 0x3333u);
    dspic33_write_word(cpu, DCI_TRANSMIT_SLOTS, 0x0001u);
    dspic33_write_word(cpu, DCI_RECEIVE_SLOTS, 0x0003u);
    dspic33_write_word(cpu, DCI_CONTROL1, DCI_ENABLE | DCI_EXTERNAL_CLOCK);
    expect(state, clock_word(cpu, 0u, false), "clock preloaded TXBUF0");
    expect(state, dspic33_dci_transmit(cpu, &transfer) && transfer.value == 0x1111u,
           "TXBUF preload before TSCON supplies active buffer zero");
    expect(state, clock_word(cpu, 0u, false) && clock_word(cpu, 0u, false),
           "advance mixed slots to preloaded TXBUF2");
    expect(state,
           dspic33_dci_transmit(cpu, &transfer) &&
               dspic33_dci_transmit(cpu, &transfer) && transfer.value == 0x3333u,
           "TXBUF preload before TSCON supplies active buffer two");
}

static void interrupt_dma_cases(DciConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    enable_interrupt(cpu, DCI_ERROR_IRQ, 4u);
    enable_interrupt(cpu, DCI_TRANSFER_IRQ, 3u);
    cpu->w[15] = 0x1800u;
    configure_external(cpu, 0u, 16u, 1u, 1u, 1u, 1u);
    dspic33_write_word(cpu, DCI_TRANSMIT_BASE, 0x3456u);
    expect(state, clock_word(cpu, 0x1234u, false), "clock IRQ fixture");
    expect(state, interrupt_set(cpu, DCI_TRANSFER_IRQ), "block transfer raises IRQ60");
    expect(state, interrupt_set(cpu, DCI_ERROR_IRQ), "TX underflow raises IRQ59");
    expect(state,
           dspic33_device_service_interrupt(cpu) &&
               cpu->last_interrupt == DCI_ERROR_IRQ,
           "higher-priority DCI error vectors first");
    expect(state, cpu->pc == DCI_VECTOR, "DCI error uses IRQ59 vector");
    clear_interrupt(cpu, DCI_ERROR_IRQ);

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x4000u, 0x7a5au);
    configure_dma(cpu, 1u, 0x2001u, 0x4000u, DCI_TRANSMIT_BASE, 0u, DCI_DMA_REQUEST);
    configure_external(cpu, 0u, 16u, 1u, 1u, 1u, 0u);
    expect(state, clock_word(cpu, 0u, false), "clock initial TX DMA block");
    expect(state, dspic33_device_advance(cpu, 2u), "complete DCI TX DMA transfer");
    expect(state, clock_word(cpu, 0u, false), "clock loaded TX DMA block");
    expect(state, cpu->io.dci.last_transmit[0] == 0x7a5au,
           "DCI TX DMA copies RAM to TXBUF0");

    dspic33_reset(cpu, 0u);
    configure_dma(cpu, 0u, 0x0001u, 0x4100u, DCI_RECEIVE_BASE, 0u, DCI_DMA_REQUEST);
    configure_external(cpu, 0u, 16u, 1u, 1u, 0u, 1u);
    expect(state, clock_word(cpu, 0x6b4bu, false), "clock RX DMA block");
    expect(state, dspic33_device_advance(cpu, 2u), "complete DCI RX DMA transfer");
    expect(state, dspic33_read_word(cpu, 0x4100u) == 0x6b4bu,
           "DCI RX DMA copies RXBUF0 to RAM");

    dspic33_reset(cpu, 0u);
    configure_dma(cpu, 0u, 0x0001u, 0x4200u, DCI_RECEIVE_BASE, 0u, DCI_DMA_REQUEST);
    configure_external(cpu, 0u, 16u, 1u, 2u, 0u, 1u);
    expect(state, clock_word(cpu, 0x7777u, false) && dspic33_device_advance(cpu, 2u),
           "clock BLEN greater than zero fixture");
    expect(state, dspic33_read_word(cpu, 0x4200u) == 0u,
           "BLEN greater than zero suppresses undefined DMA request");

    dspic33_reset(cpu, 0u);
    configure_dma(cpu, 0u, 0x0001u, 0x4300u, DCI_RECEIVE_BASE, 0u, 0x3bu);
    configure_external(cpu, 0u, 16u, 1u, 1u, 0u, 1u);
    expect(state, clock_word(cpu, 0x8888u, false) && dspic33_device_advance(cpu, 2u),
           "clock wrong IRQSEL fixture");
    expect(state, dspic33_read_word(cpu, 0x4300u) == 0u,
           "wrong IRQSEL receives no DCI DMA request");

    dspic33_reset(cpu, 0u);
    enable_interrupt(cpu, DCI_TRANSFER_IRQ, 3u);
    cpu->w[15] = 0x1800u;
    cpu->power_state = DSPIC33_POWER_SLEEP;
    configure_external(cpu, 0u, 16u, 1u, 1u, 0u, 1u);
    expect(state, clock_word(cpu, 0xcccdu, false), "clock sleeping DCI fixture");
    expect(state, interrupt_set(cpu, DCI_TRANSFER_IRQ),
           "sleeping external DCI sets IRQ60");
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance sleeping DCI interrupt eligibility");
    expect(state,
           dspic33_device_wake(cpu) && cpu->last_interrupt == DCI_TRANSFER_IRQ &&
               cpu->pc == DCI_VECTOR,
           "external DCI wakes from Sleep through IRQ60 vector");

    dspic33_reset(cpu, 0u);
    enable_interrupt(cpu, DCI_TRANSFER_IRQ, 2u);
    cpu->sr = 0x0040u;
    cpu->power_state = DSPIC33_POWER_SLEEP;
    configure_external(cpu, 0u, 16u, 1u, 1u, 0u, 1u);
    expect(state, clock_word(cpu, 0xdedeu, false), "clock equal-priority DCI fixture");
    expect(state,
           dspic33_device_wake(cpu) && cpu->interrupt_count == 0u &&
               interrupt_set(cpu, DCI_TRANSFER_IRQ),
           "equal-priority DCI wakes without vector and retains IRQ60");
}

static void generation_and_frame_cases(DciConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, DCI_CONTROL2, configuration(4u, 1u, 1u));
    dspic33_write_word(cpu, DCI_CONTROL3, 1u);
    dspic33_write_word(cpu, DCI_RECEIVE_SLOTS, 1u);
    dspic33_write_word(cpu, DCI_CONTROL1, DCI_ENABLE);
    expect(state, dspic33_device_advance(cpu, 1u), "advance before stale DCI start");
    dspic33_write_word(cpu, DCI_CONTROL1, 0u);
    dspic33_write_word(cpu, DCI_CONTROL1, DCI_ENABLE);
    expect(state,
           dspic33_device_advance(cpu, 11u) && cpu->io.dci.internal_scheduled &&
               !cpu->io.dci.initialized,
           "stale start event cannot clear current scheduling latch");
    expect(state, dspic33_device_advance(cpu, 1u) && cpu->io.dci.initialized,
           "current generation start event initializes DCI");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, DCI_CONTROL2, configuration(16u, 1u, 1u));
    dspic33_write_word(cpu, DCI_CONTROL3, 1u);
    dspic33_write_word(cpu, DCI_RECEIVE_SLOTS, 1u);
    dspic33_write_word(cpu, DCI_CONTROL1, DCI_ENABLE | DCI_EXTERNAL_FRAME);
    expect(state, clock_word(cpu, 0x1111u, true),
           "external FS before internal startup is accepted as physical input");
    expect(state,
           dspic33_device_advance(cpu, 96u) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0u,
           "pre-start and absent FS cannot arm internal-frame transfer");
    expect(state, clock_word(cpu, 0x2222u, true),
           "external FS arms initialized internal-frame transfer");
    expect(state,
           dspic33_device_advance(cpu, 63u) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0u,
           "internal-frame word remains pending before full interval");
    expect(state,
           dspic33_device_advance(cpu, 1u) &&
               dspic33_read_word(cpu, DCI_RECEIVE_BASE) == 0x2222u,
           "internal-frame word completes after external FS");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, DCI_PMD, DCI_PMD_MASK);
    dspic33_write_word(cpu, DCI_PMD, 0u);
    expect(state,
           dspic33_device_advance(cpu, 1u) && !cpu->io.dci.pmd_disabled &&
               cpu->io.dci.pmd_generation == 2u,
           "rapid PMD toggle rejects stale disabled generation");
}

